cases/F23b_HP_WEDGE/case/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet   { type cyclic; }
    outlet  { type cyclic; }
    wall    { type zeroGradient; }
    wedge1  { type wedge; }
    wedge2  { type wedge; }
}
