cases/F23b_HP_WEDGE/case/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
  F23 -- Hagen-Poiseuille pipe as an OpenFOAM axisymmetric WEDGE, one cell
  thick in the azimuthal direction, streamwise CYCLIC (fully developed).
  Lineage: cases/ansys_verification/VMFL005/case/system/blockMeshDict.template
  (repeated-vertex hex, mergeType points, wall vertices at EXACT radius R).

  x streamwise [0, L], r radial [0, R] along +y, wedge symmetric about z = 0.
  Half angle __HALF_ANGLE_DEG__ deg:  y_w = R cos(a),  z_w = +/- R sin(a).
  The wedge under-represents the circular section by O(a^2)
  (NUMERICS_KNOWLEDGE N-AV9); the half angle is chosen so that this bias is
  below the fine level's discretisation error (prereg section 2, section 5).
  __NX__ axial cells, __NR__ radial cells, uniform: dx = dr = R/__NR__.
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

mergeType points;   // wedge geometry: merge the coincident axis points
scale   1;

vertices
(
    (0            0                0               )   // 0  inlet  axis
    (__L__        0                0               )   // 1  outlet axis
    (0            __YW__          -__ZW__          )   // 2  inlet  wall back  (z<0)
    (__L__        __YW__          -__ZW__          )   // 3  outlet wall back
    (0            __YW__           __ZW__          )   // 4  inlet  wall front (z>0)
    (__L__        __YW__           __ZW__          )   // 5  outlet wall front
);

blocks
(
    hex (0 1 3 2  0 1 5 4) (__NX__ __NR__ 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet   { type cyclic; neighbourPatch outlet; faces ((0 2 4 0)); }
    outlet  { type cyclic; neighbourPatch inlet;  faces ((1 3 5 1)); }
    wall    { type wall;   faces ((2 3 5 4)); }
    wedge1  { type wedge;  faces ((0 2 3 1)); }
    wedge2  { type wedge;  faces ((0 1 5 4)); }
);

mergePatchPairs ();
