cases/F23b_HP_WEDGE/case/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  F23 -- 4 ranks at EVERY level, `simple` geometric decomposition into 4 bands
  along the RADIAL (y) direction: the cyclic inlet/outlet pair stays intact
  on every rank (no processorCyclic), the wedge pair likewise.  Deterministic:
  no RNG, no seed (the registered "decomposition seed: none").
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object decomposeParDict; }

numberOfSubdomains 4;
method          simple;
coeffs { n (1 4 1); }
